Fixed and released, please see the latest version: https://registry.terraform.io/providers/fortinetdev/fortios/latest
```hcl
# cat main.tf
provider "fortios" {
  hostname = "192.168.52.177"
  insecure = "true"
  token    = "GNH7r40H65GNb46kd4rG8rtrmn0fr1"
}

locals {
  networks = [
    "1.1.1.1 255.255.255.255",
    "1.1.1.2 255.255.255.255",
    "1.1.1.3 255.255.255.255",
    "1.1.1.4 255.255.255.255",
    "1.1.1.5 255.255.255.255",
    "1.1.1.6 255.255.255.255",
    "1.1.1.7 255.255.255.255",
    "1.1.1.8 255.255.255.255",
    "1.1.1.9 255.255.255.255",
    "1.1.1.11 255.255.255.255",
    "1.1.1.12 255.255.255.255",
    "1.1.1.19 255.255.255.255",
    "1.1.1.23 255.255.255.255",
    "1.1.1.119 255.255.255.255",
  ]
}

resource fortios_router_bgp "test" {
  dynamic_sort_subtable = true

  as = 65555

  dynamic "network" {
    for_each = local.networks

    content {
      prefix = network.value
    }
  }

  lifecycle {
    create_before_destroy = false
  }
}

output "debug" {
  value = fortios_router_bgp.test
}

```

``` 
# terraform apply
2021/06/14 01:01:57 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # fortios_router_bgp.test will be created
  + resource "fortios_router_bgp" "test" {
      + additional_path                    = (known after apply)
      + additional_path6                   = (known after apply)
      + additional_path_select             = (known after apply)
      + additional_path_select6            = (known after apply)
      + always_compare_med                 = (known after apply)
      + as                                 = 65555
      + bestpath_as_path_ignore            = (known after apply)
      + bestpath_cmp_confed_aspath         = (known after apply)
      + bestpath_cmp_routerid              = (known after apply)
      + bestpath_med_confed                = (known after apply)
      + bestpath_med_missing_as_worst      = (known after apply)
      + client_to_client_reflection        = (known after apply)
      + cluster_id                         = (known after apply)
      + confederation_identifier           = (known after apply)
      + dampening                          = (known after apply)
      + dampening_max_suppress_time        = (known after apply)
      + dampening_reachability_half_life   = (known after apply)
      + dampening_reuse                    = (known after apply)
      + dampening_route_map                = (known after apply)
      + dampening_suppress                 = (known after apply)
      + dampening_unreachability_half_life = (known after apply)
      + default_local_preference           = (known after apply)
      + deterministic_med                  = (known after apply)
      + distance_external                  = (known after apply)
      + distance_internal                  = (known after apply)
      + distance_local                     = (known after apply)
      + dynamic_sort_subtable              = "true"
      + ebgp_multipath                     = (known after apply)
      + enforce_first_as                   = (known after apply)
      + fast_external_failover             = (known after apply)
      + graceful_end_on_timer              = (known after apply)
      + graceful_restart                   = (known after apply)
      + graceful_restart_time              = (known after apply)
      + graceful_stalepath_time            = (known after apply)
      + graceful_update_delay              = (known after apply)
      + holdtime_timer                     = (known after apply)
      + ibgp_multipath                     = (known after apply)
      + id                                 = (known after apply)
      + ignore_optional_capability         = (known after apply)
      + keepalive_timer                    = (known after apply)
      + log_neighbour_changes              = (known after apply)
      + multipath_recursive_distance       = (known after apply)
      + network_import_check               = (known after apply)
      + recursive_next_hop                 = (known after apply)
      + router_id                          = (known after apply)
      + scan_time                          = (known after apply)
      + synchronization                    = (known after apply)

      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.1 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.2 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.3 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.4 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.5 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.6 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.7 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.8 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.9 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.11 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.12 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.19 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.23 255.255.255.255"
          + route_map = (known after apply)
        }
      + network {
          + backdoor  = (known after apply)
          + id        = (known after apply)
          + prefix    = "1.1.1.119 255.255.255.255"
          + route_map = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

fortios_router_bgp.test: Creating...
fortios_router_bgp.test: Creation complete after 0s [id=RouterBgp]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

debug = {
  "additional_path" = "disable"
  "additional_path6" = "disable"
  "additional_path_select" = 2
  "additional_path_select6" = 2
  "admin_distance" = []
  "aggregate_address" = []
  "aggregate_address6" = []
  "always_compare_med" = "disable"
  "as" = 65555
  "bestpath_as_path_ignore" = "disable"
  "bestpath_cmp_confed_aspath" = "disable"
  "bestpath_cmp_routerid" = "disable"
  "bestpath_med_confed" = "disable"
  "bestpath_med_missing_as_worst" = "disable"
  "client_to_client_reflection" = "enable"
  "cluster_id" = "0.0.0.0"
  "confederation_identifier" = 0
  "confederation_peers" = []
  "dampening" = "disable"
  "dampening_max_suppress_time" = 60
  "dampening_reachability_half_life" = 15
  "dampening_reuse" = 750
  "dampening_route_map" = ""
  "dampening_suppress" = 2000
  "dampening_unreachability_half_life" = 15
  "default_local_preference" = 100
  "deterministic_med" = "disable"
  "distance_external" = 20
  "distance_internal" = 200
  "distance_local" = 200
  "dynamic_sort_subtable" = "true"
  "ebgp_multipath" = "disable"
  "enforce_first_as" = "enable"
  "fast_external_failover" = "enable"
  "graceful_end_on_timer" = "disable"
  "graceful_restart" = "disable"
  "graceful_restart_time" = 120
  "graceful_stalepath_time" = 360
  "graceful_update_delay" = 120
  "holdtime_timer" = 180
  "ibgp_multipath" = "disable"
  "id" = "RouterBgp"
  "ignore_optional_capability" = "enable"
  "keepalive_timer" = 60
  "log_neighbour_changes" = "enable"
  "multipath_recursive_distance" = "disable"
  "neighbor" = []
  "neighbor_group" = []
  "neighbor_range" = []
  "neighbor_range6" = []
  "network" = [
    {
      "backdoor" = "disable"
      "id" = 1
      "prefix" = "1.1.1.1 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 2
      "prefix" = "1.1.1.2 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 3
      "prefix" = "1.1.1.3 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 4
      "prefix" = "1.1.1.4 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 5
      "prefix" = "1.1.1.5 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 6
      "prefix" = "1.1.1.6 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 7
      "prefix" = "1.1.1.7 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 8
      "prefix" = "1.1.1.8 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 9
      "prefix" = "1.1.1.9 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 10
      "prefix" = "1.1.1.11 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 11
      "prefix" = "1.1.1.12 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 12
      "prefix" = "1.1.1.19 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 13
      "prefix" = "1.1.1.23 255.255.255.255"
      "route_map" = ""
    },
    {
      "backdoor" = "disable"
      "id" = 14
      "prefix" = "1.1.1.119 255.255.255.255"
      "route_map" = ""
    },
  ]
  "network6" = []
  "network_import_check" = "enable"
  "recursive_next_hop" = "disable"
  "redistribute" = []
  "redistribute6" = []
  "router_id" = "10.1.1.1"
  "scan_time" = 60
  "synchronization" = "disable"
  "vrf_leak" = []
}
``` 
``` 
# terraform plan
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

fortios_router_bgp.test: Refreshing state... [id=RouterBgp]

------------------------------------------------------------------------

No changes. Infrastructure is up-to-date.

This means that Terraform did not detect any differences between your
configuration and real physical resources that exist. As a result, no
actions need to be performed.

``` 
Thanks!